Davidn00/digital_thermometer/Microchip Packs/edc/PIC18LF4431.PIC
        <edc:SFRDef edc:access="-nn-nnnn" edc:cname="CAP1CON" edc:desc="" edc:impl="0x6f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-10-0000" edc:name="CAP1CON" edc:nzwidth="0x8" edc:por="-10-0000" edc:_addr="0xF63">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CAP1M" edc:desc="" edc:mask="0xf" edc:name="CAP1M" edc:nzwidth="0x4"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CAP1TMR" edc:desc="" edc:mask="0x1" edc:name="CAP1TMR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CAP1REN" edc:desc="" edc:mask="0x1" edc:name="CAP1REN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CAP1M0" edc:desc="" edc:mask="0x1" edc:name="CAP1M0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CAP1M1" edc:desc="" edc:mask="0x1" edc:name="CAP1M1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CAP1M2" edc:desc="" edc:mask="0x1" edc:name="CAP1M2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CAP1M3" edc:desc="" edc:mask="0x1" edc:name="CAP1M3" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CAP3BUFL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="CAP3BUFL" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xF64">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="MAXCNTL"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CAP3BUFL" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="CAP3BUFL" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CAP3BUFH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="CAP3BUFH" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xF65">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="MAXCNTH"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CAP3BUFH" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="CAP3BUFH" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CAP2BUFL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="CAP2BUFL" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xF66">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="POSCNTL"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CAP2BUFL" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="CAP2BUFL" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CAP2BUFH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="CAP2BUFH" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xF67">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="POSCNTH"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CAP2BUFH" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="CAP2BUFH" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CAP1BUFL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="CAP1BUFL" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xF68">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="VELRL"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CAP1BUFL" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="CAP1BUFL" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CAP1BUFH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="CAP1BUFH" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xF69">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="VELRH"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CAP1BUFH" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="CAP1BUFH" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="OVDCONS" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="OVDCONS" edc:nzwidth="0x8" edc:por="00000000" edc:_addr="0xF6A">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="POUT" edc:desc="" edc:mask="0xff" edc:name="POUT" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="POUT0" edc:desc="" edc:mask="0x1" edc:name="POUT0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="POUT1" edc:desc="" edc:mask="0x1" edc:name="POUT1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="POUT2" edc:desc="" edc:mask="0x1" edc:name="POUT2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="POUT3" edc:desc="" edc:mask="0x1" edc:name="POUT3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="POUT4" edc:desc="" edc:mask="0x1" edc:name="POUT4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="POUT5" edc:desc="" edc:mask="0x1" edc:name="POUT5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="POUT6" edc:desc="" edc:mask="0x1" edc:name="POUT6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="POUT7" edc:desc="" edc:mask="0x1" edc:name="POUT7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="OVDCOND" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="OVDCOND" edc:nzwidth="0x8" edc:por="11111111" edc:_addr="0xF6B">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="POVD" edc:desc="" edc:mask="0xff" edc:name="POVD" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="POVD0" edc:desc="" edc:mask="0x1" edc:name="POVD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="POVD1" edc:desc="" edc:mask="0x1" edc:name="POVD1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="POVD2" edc:desc="" edc:mask="0x1" edc:name="POVD2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="POVD3" edc:desc="" edc:mask="0x1" edc:name="POVD3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="POVD4" edc:desc="" edc:mask="0x1" edc:name="POVD4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="POVD5" edc:desc="" edc:mask="0x1" edc:name="POVD5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="POVD6" edc:desc="" edc:mask="0x1" edc:name="POVD6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="POVD7" edc:desc="" edc:mask="0x1" edc:name="POVD7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="FLTCONFIG" edc:desc="" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="FLTCONFIG" edc:nzwidth="0x8" edc:por="00000000" edc:_addr="0xF6C">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FLTAEN" edc:desc="" edc:mask="0x1" edc:name="FLTAEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FLTAMOD" edc:desc="" edc:mask="0x1" edc:name="FLTAMOD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FLTAS" edc:desc="" edc:mask="0x1" edc:name="FLTAS" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FLTCON" edc:desc="" edc:mask="0x1" edc:name="FLTCON" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FLTBEN" edc:desc="" edc:mask="0x1" edc:name="FLTBEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FLTBMOD" edc:desc="" edc:mask="0x1" edc:name="FLTBMOD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FLTBS" edc:desc="" edc:mask="0x1" edc:name="FLTBS" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BRFEN" edc:desc="" edc:mask="0x1" edc:name="BRFEN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="DTCON" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="DTCON" edc:nzwidth="0x8" edc:por="00000000" edc:_addr="0xF6D">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DTA" edc:desc="" edc:mask="0x3f" edc:name="DTA" edc:nzwidth="0x6"/>
              <edc:SFRFieldDef edc:cname="DTAPS" edc:desc="" edc:mask="0x3" edc:name="DTAPS" edc:nzwidth="0x2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="DT0" edc:desc="" edc:mask="0x1" edc:name="DT0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DT1" edc:desc="" edc:mask="0x1" edc:name="DT1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DT2" edc:desc="" edc:mask="0x1" edc:name="DT2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DT3" edc:desc="" edc:mask="0x1" edc:name="DT3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DT4" edc:desc="" edc:mask="0x1" edc:name="DT4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DT5" edc:desc="" edc:mask="0x1" edc:name="DT5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DTPS0" edc:desc="" edc:mask="0x1" edc:name="DTPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DTPS1" edc:desc="" edc:mask="0x1" edc:name="DTPS1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="DTA0" edc:desc="" edc:mask="0x1" edc:name="DTA0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DTA1" edc:desc="" edc:mask="0x1" edc:name="DTA1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DTA2" edc:desc="" edc:mask="0x1" edc:name="DTA2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DTA3" edc:desc="" edc:mask="0x1" edc:name="DTA3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DTA4" edc:desc="" edc:mask="0x1" edc:name="DTA4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DTA5" edc:desc="" edc:mask="0x1" edc:name="DTA5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DTAPS0" edc:desc="" edc:mask="0x1" edc:name="DTAPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DTAPS1" edc:desc="" edc:mask="0x1" edc:name="DTAPS1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnn-nn" edc:cname="PWMCON1" edc:desc="" edc:impl="0xfb" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000-00" edc:name="PWMCON1" edc:nzwidth="0x8" edc:por="00000-00" edc:_addr="0xF6E">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="OSYNC" edc:desc="" edc:mask="0x1" edc:name="OSYNC" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="UDIS" edc:desc="" edc:mask="0x1" edc:name="UDIS" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="SEVTDIR" edc:desc="" edc:mask="0x1" edc:name="SEVTDIR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEVOPS" edc:desc="" edc:mask="0xf" edc:name="SEVOPS" edc:nzwidth="0x4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="SEVOPS0" edc:desc="" edc:mask="0x1" edc:name="SEVOPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEVOPS1" edc:desc="" edc:mask="0x1" edc:name="SEVOPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEVOPS2" edc:desc="" edc:mask="0x1" edc:name="SEVOPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEVOPS3" edc:desc="" edc:mask="0x1" edc:name="SEVOPS3" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnnnnnn" edc:cname="PWMCON0" edc:desc="" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-1010000" edc:name="PWMCON0" edc:nzwidth="0x8" edc:por="-1010000" edc:_addr="0xF6F">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PMOD" edc:desc="" edc:mask="0xf" edc:name="PMOD" edc:nzwidth="0x4"/>
              <edc:SFRFieldDef edc:cname="PWMEN" edc:desc="" edc:mask="0x7" edc:name="PWMEN" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PMOD0" edc:desc="" edc:mask="0x1" edc:name="PMOD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PMOD1" edc:desc="" edc:mask="0x1" edc:name="PMOD1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PMOD2" edc:desc="" edc:mask="0x1" edc:name="PMOD2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PMOD3" edc:desc="" edc:mask="0x1" edc:name="PMOD3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWMEN0" edc:desc="" edc:mask="0x1" edc:name="PWMEN0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWMEN1" edc:desc="" edc:mask="0x1" edc:name="PWMEN1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWMEN2" edc:desc="" edc:mask="0x1" edc:name="PWMEN2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="SEVTCMPH" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="SEVTCMPH" edc:nzwidth="0x8" edc:por="----0000" edc:_addr="0xF70">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SEVTCMPH" edc:desc="" edc:islanghidden="true" edc:mask="0xf" edc:name="SEVTCMPH" edc:nzwidth="0x4"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="SEVTCMPL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="SEVTCMPL" edc:nzwidth="0x8" edc:por="00000000" edc:_addr="0xF71">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SEVTCMPL" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="SEVTCMPL" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
